# У каждой методологии есть свои ценности, но не у каждой методологии они чётко сформулированы. У Agile же есть четыре
# чётких принципа, которых нужно придерживаться:
#
# Люди и взаимодействия важнее процессов и инструментов.
# Работающий продукт и важнее исчерпывающей документации.
# Сотрудничество с заказчиком важнее согласования условий контракта.
# Готовность к изменениям важнее следования первоначальному плану.
# Конечно, не все из перечисленных принципов получается соблюдать, это нормально. Так как методологии являются гибкими,
# их можно подстраивать под себя.
#
# Agile объединяет в себе различные методологии. Здесь крупный проект разделяется на несколько мелких задач, каждой из
# которых присваивается свой срок завершения.
#
#
#
# Пример работы с использованием Agile-методологии
#
# Рассмотрим, как работает обычный хлебозавод и хлебозавод, взявший на вооружение agile-подход.
#
# На обычном хлебозаводе гендиректор, решив внедрить новый сорт хлеба, даёт это задание технологу. В лучше случае
# технолог обратиться в отдел маркетинга, чтобы провести исследование запросов потребителей - однако в большинстве
# случаев даже этого не происходит, технолог просто выполняет задачу так, как он её понимает. Разработав новый сорт,
# он пробует продукт сам, даёт попробовать директору, и директор озвучивает решение: либо одобряет результат, либо
# вносит правки. После того как внесены все правки и всё утверждено, технолог передаёт технологическую карту пекарям,
# и этот продукт реализуется — его начинают печь и продавать.
#
# Если же на хлебозаводе применяют принципы Agile, работа будет строиться по-другому. Гендиректор, решив разработать
# новый сорт хлеба, собирает команду, в которую входят не только технолог и маркетолог, но и продавцы, логисты, пекари,
# кондитеры, покупатели — все, кто связан с этим продуктом, чтобы в итоге получить идеальный результат. В Agile
# отсутствует иерархия, команда сотрудничает для создания конкретного продукта и для достижения цели. В течение всего
# процесса сотрудники оценивают результат и выдают обратную связь для улучшения. Результатом их работы будет не награда
# одного сотрудника, а получение нового сорта хлеба, который будут раскупать покупатели. Agile нацелен на то, чтобы
# проработать все мелочи и угодить клиенту.
#
# Agile применяют не только в компаниях, связанных с IT. Например, Agile используют такие компании, как Альфа-банк,
# Додо-пицца и многие другие.
#
# Рассмотрим Agile-подход на примере разработки компьютерной игры
#
# При Agile-подходе мы начнём со сбора требований и идей для будущей игры. Так как в команде Agile все работают
# наравне, каждый может вносить свои предложения.
# Собрав все требования и идеи, мы начинаем планировать работу над игрой, решая, с какой функции начнём. Можно не
# прописывать все задачи сразу, поскольку в дальнейшем может так сложиться, что мы будем что-то адаптировать и менять.
# Далее начинается процесс разработки, и здесь, как и в Scrum, подключаются спринты. Мы делим работу на короткие
# периоды и за один период создаём какую-то часть игры, которая уже работает и которую можно протестировать.
# Завершив один спринт, мы отдаём часть игры тестовой группе игроков, которые просматривают её, пробуют и дают обратную
# связь.
# После получения обратной связи мы, исходя из отзывов, начинаем работу над следующей задачей либо над улучшением
# прошлой задачи.
# Мы повторяем эти этапы, пока не решим все поставленные задачи.
# В заключительной части проекта мы запускаем релиз игры, получаем положительные отзывы и празднуем успех.
# Agile помогает создавать проект пошагово, с постоянной обратной связью, в том числе на ранных стадиях разработки, и
# гарантирует, что результат понравится пользователям. Другие методологии тоже всё это позволяют, но ещё раз повторим,
# что Agile — это скорее комбинирование различных элементов других методологий, как и другие методологии заимствуют те
# или иные элементы друг у друга.
#
# Плюсы методологии Agile
#
# Высокая адаптивность. Agile подчёркивает важность адаптации к изменяющимся условиям и требованиям. Мы можем в ходе
# работы изменять проект как частично, так и полностью, и Agile позволяет к этому адаптироваться.
# Улучшенная продуктовая ценность. Мы чётко доносим клиенту ценности своих продуктов.
# Прозрачность и коммуникация. Команда постоянно взаимодействует друг с другом и все работают наравне.
# Минусы методологии Agile
#
# Может быть труден для понимания и внедрения. Многим он сначала кажется сложным, но к нему нужно просто привыкнуть.
# Может потребоваться дополнительное внимание к управлению приоритетами.
# Требует приверженности и изменения культуры. Без заинтересованности руководителя здесь не обойтись. Если руководитель
# не будет контролировать внедрение этой методологии, поддерживать и участвовать в этом, скорее всего, ничего работать
# не будет.
# Методология Agile соперничает со Scrum по популярности, но Scrum больше подходит именно для IT-компаний, а Agile
# могут использовать самые разные отрасли.